{"rows":[["07/11/2022 09:25:22","Sim","Mestrado","5","UFBA","Sim","5","5","Não","","Não","","Sim","","Sim","teste"],["10/11/2022 04:27:32","Sim","Mestrado","25","UNEB","Sim","3","4","Sim","Ajudaria muito pra o seu dia a dia no mundo do trabalho ","Sim","Sim, facilitaria o processo ensino aprendizagem ","Sim","Posso tentar","Não","Através de formação "],["10/11/2022 15:51:58","Sim","Especialização","8","FSSS","Não","","","","","","","","","",""],["10/11/2022 18:24:12","Sim","Doutorado em andamento","11","IFBA","Sim","3","4","Sim","Como um dos componentes da competência é o saber como aplicar o conhecimento e as habilidades necessárias para isso, o ensino baseado em competências pode tornar a adaptação para o mercado de trabalho mais rápida. ","Sim","Uma parte importante do ensino baseado em competências é trabalhar a motivação dos estudantes em conjunto com as habilidades necessárias para a realização de atividades na área. Desta forma, poderíamos dirimir a visão de que muitos estudantes possuem de que as etapas iniciais da formação nos cursos de computação é excessivamente conteudista e teórica.","Não","Não me julgo competente suficiente para ministrar um curso apesar de saber algumas noções sobre o tema. Mas com certeza participaria de uma formação.","Não","Promovendo seminários e formação continuada sobre o assunto, principalmente no que diz respeito à criação de currículos e sua implementação pedagógica em sala de aula. "],["11/11/2022 10:53:11","Sim","Doutorado em andamento","3 anos","UFBA","Não","","","","","","","","","",""],["11/11/2022 10:56:35","Sim","Mestrado em andamento","10","FSSS","Sim","3","4","Sim","Aprendizagem  em um ritmo altamente individualizado.","Sim","-","Sim","Seria uma ótima experiência.","Não","Mostrando a importância da mesma."],["11/11/2022 22:06:24","Sim","Mestrado em andamento","28","FSSS","Sim","5","5","Sim","Possibilitará talvez ao egresso ser especialista nas habilidades de interesse ","Sim","Cria melhores condições de desenvolver habilidades com focos específicos ","Sim","É importante um planejamento de curso detalhado e clareza dos objetivos do conhecimento e habilidades. Qualquer curso tem o objetivo de dar competência, porém, com as especificações norteadores das competências a serem claramente desenvolvidas, possibilita um maior acompanhamento e desenvolvimento desses competências ","Sim","Através da mobilização e sensibilização da comunidade acadêmica esclarecendo a proposta, incentivando sua implementação através de procedimento de implantação, estudo dos documentos norteadores, definição de resultados, utilização de estratégias de implantação da proposta e acompanhamento do processo."],["14/11/2022 08:54:05","Sim","Doutorado em andamento","16","UEFS","Não","","","","","","","","","",""],["18/11/2022 17:15:23","Sim","Doutorado","24","UEFS","Sim","3","5","Sim","Traz elementos como resolução de problemas, habilidades e atitudes esperadas para trabalhos em grupos/equipes, reflexão crítica das situações vivenciadas no ambiente de trabalho, dentre outros.","Sim","De forma semelhante à resposta anterior, Ensino baseado em competências poderá permitir o desenvolvimento de habilidades também chamadas de soft skills, para além dos conhecimentos técnicos necessários, o que pode possibilitar ao estudante de computação atitudes resolutivas de problemas, sejam estes de cunho técnico ou social (como inclusão e acessibilidade, por exemplo), assim como postura crítica/reflexiva sobre as questões relacionadas. O estudante pode ganhar mais autonomia no seu processo de aprendizagem (aprendendo a aprender constantemente), com orientação/mediação docente, importante no processo construtivo.","Sim","Acredito que metodologias que permitam ao estudante exercer um papel mais ativo e central em seu processo permanente de aprendizagem possibilitam importantes construções cognitivas e formativas, tanto para o estudante quanto para o professor/educador.","Não","Embora não exatamente com esta nomenclatura, a nossa instituição já trabalha estratégias de ensino que se assemelham a esta proposta e que caminham de maneiras semelhantes. Entretanto, são iniciativas pontuais ou de alguns cursos específicos. Acredito que a formação docente continuada seja um caminho para a compreensão de novas estratégias e metodologias de ensino, sobretudo com estudos de casos, relatos de experiências, que evidenciem casos de sucesso e/ou como estas estratégias e metodologias podem ser aplicadas nos ensino fundamental, médio e superior."],["23/11/2022 08:46:49","Sim","Mestrado","4","IFBA","Não","","","","","","","","","",""],["23/11/2022 08:57:21","Sim","Doutorado","17 anos","IFBA","Sim","5","5","Sim","Mostrar a evolução do aluno com relação as suas competências educacionais é muito melhor do que uma nota recebida em apenas um momento de seu aprendizado.","Sim","A avaliação por competências é o acompanhamento de uma novela. Já a avaliação formal e apenas a análise de uma foto. O momento talvez não reflita a realidade.","Sim","Seria muito interessante para comprovar minha tese sobre o assunto.","Não","Mostrando a ele as comparações sobre os 2 métodos avaliativos."],["23/11/2022 10:34:53","Sim","Doutorado em andamento","30","UESB","Sim","4","3","Sim","Embora não seja a \"solução\", uma vez que não reune em si mesma uma metodologia que dê conta da formação teórica e prática adequadas aos diversos tipos e necessidades estudantis, ela pode ser usada como referência em alguns contextos. Como temos estudantes que priorizam a prática, como aprendizado, será necessário atendê-lo no quesito teórico, e vice-versa, com outras metodologias. Usar apenas uma metodologia ou estratégia de ensino é pensar que o nosso público é homogêneo o suficiente para ser formatado e sair como se tivessem passado por operações unitárias fabris.","Sim","Como mencionei na resposta anterior, considero UMA boa forma, mas não para utilizar de forma exclusiva. ","Sim","Seria interessante identificar uma parte de algum componente curricular com qual trabalhar nessa perspectiva teórica, desde a seleção das competências, as atividades a serem desenvolvidas e o tipo de avaliação a ser usado para finalizar o processo coerentemente com a escolha teórico-metodológica.","Não","Criando um itinerário formativo para o docente, numa política institucional de formação docente."],["23/11/2022 11:05:19","Sim","Mestrado","15","IFBA","Não","","","","","","","","","",""],["23/11/2022 14:31:53","Sim","Doutorado","18","UEFS","Não","","","","","","","","","",""],["23/11/2022 16:49:26","Sim","Doutorado em andamento","16","UESC","Não","","","","","","","","","",""],["23/11/2022 16:54:33","Sim","Doutorado","30 anos","UESB","Sim","4","4","Sim","A referida metodologia trata o professor como mediador dos processos de ensino e aprendizagem nos quais alunos e professores são agentes colaborativos para a construção do conhecimento. Ambos são emissores e receptores da mensagem/conhecimento construído coletivamente. ","Sim","Torna os processos ensino e aprendizagem mais atrativos e colaborativos. ","Sim","Trabalho com tecnologias educacionais e busco por um ambiente de aprendizado numa perspectiva hibrida, numa lógica comunicacional entres os agentes(professor, alunos e conhecimento). ","Não","Com a formação continuada dos docentes e a conectividade dos espaços de aprendizado de modo a permitir a comunicabilidade dos agentes numa perspectiva de ambiência híbrida de aprendizagem. "],["23/11/2022 17:21:12","Sim","Mestrado","26 anos","UESB","Não","","","","","","","","","",""],["23/11/2022 17:34:26","Sim","Doutorado","26","UESC ","Sim","4","4","Sim","Sim, pois foca nas competências a serem adquiridas e sua aplicação na vida profissional ","Sim","Se o PPC contemplar a metodologia.","Sim","Acredito que o formulário pode ser melhorado.","Não","Discutindo a metodologia nos NDEs"],["23/11/2022 17:38:29","Sim","Mestrado","9","UNIVASF","Sim","2","5","Sim","Por muitas vezes o foco da formação dos nossos alunos é apenas em conhecimento   técnicos que nós professores identificamos como importantes, baseados apenas na nossa visão.","Sim","Formas de aprendizagem que possam individualizar os alunos de acordo com suas limitações/facilidades são bem vindas.","Não","Não tenho conhecimento aprofundado para tal.","Não","Oficinas."],["23/11/2022 18:27:41","Sim","Doutorado","20","UNIVASF","Sim","3","4","Sim","Parte do pressuposto do contexto do estudante para a proposição de situações que lhe seja significativa. Assim, é possível pensar e orientar uma aprendizagem que se organiza em projetos e baseada em problemas do mundo real.","Sim","Possibilita ao estudante desenvolver autonomia em aprender e aprender sozinho por toda a sua vida em situações contextualizadas e significativas","Sim","Na verdade, já trabalho orientado nessa perspectiva tanto em atividades presenciais quanto em atividades híbridas","Não","Primeiro, há muita resistência, principalmente, em instituições públicas, uma vez que cada docente possui seus hábitos e práticas quanto ao ensino. Além disso, destaco a falta de experiência dos docentes de ES no mercado: Como abordar \"competências\" que você tem pouca ou nenhuma familiaridade?"],["23/11/2022 21:04:55","Sim","Doutorado","10","UESC","Sim","3","3","Sim","Enquanto a melhor preparação individual, melhor resultado deve obter o profissional.","Não","As turmas tem que ser pequenas ou tem que ter muitos docentes por turma; em qualquer caso, há um compromisso entre o investimento social na educação e possibilidade de atender cada aluno individualmente","Não","Precisamos atender grande demanda de alunos por semestre.","Sim","Aumentando a planta docente."],["24/11/2022 06:55:01","Sim","Doutorado em andamento","31","UESC","Sim","5","0","Não","Ninguém pratica. Há mais de 30 anos dando aula e vejo os docentes com a mesma prática em todos estes anos","Não","A prática usada é educação baseada em conteúdo. Nem os projetos pedagógicos que são feitos, em princípio, baseado em competências o é, de fato.","Não","Já construí e coordenei dois cursos superior de tecnologia baseado em competências, mas os docentes não se engajavam. O resultado, se não agisse com mão de ferro, seria um curso pior se tivesse sido feito baseado em conteúdos.","Não","Na instituição na qual fiz o curso baseado em competências, a instituição queria isto, mas, por fim, demitiram a coordenadora pedagógica e desandou tudo. Para os docentes trabalharem em cursos baseados em competências, teriam de trabalhar um colaborando com outro, e isto é quase impossível."],["24/11/2022 08:40:36","Sim","Doutorado","30","UFBA","Não","","","","","","","","","",""],["24/11/2022 08:48:09","Sim","Mestrado","20","UESC","Sim","3","4","Sim","Aproximar o aluno de casos reais e trabalhar a visão multidisciplinar ainda na sala de aula pode contribuir no engajamento do futuro profissional no mercado.","Sim","Pode contribuir para desenvolver o gosto pelo estudo de matérias básicas por esclarecer onde elas serão aplicadas no mundo do trabalho.","Sim","Já fiz alguns ensaios, mas sem aplicar completamente a metodologia. Ainda assim os resultados foram bastante satisfatórios em relação a satisfação do aluno e ao nível de aprendizado. ","Não","Com palestras e capacitação dos professores. Se nós professores não tivermos uma formação sólida, o método tende a não funcionar. Lembrando que poucos de nós tivemos esta experiência enquanto alunos."],["24/11/2022 09:32:25","Sim","Mestrado","11","IFBA","Sim","0","5","Sim","Resolvendo problema e simulando situação do dia a dia das empresas","Sim","Sim, principalmente em disciplinas totalmente práticas, como programação e banco de dados.","Sim","Sim, gostaria de ter oportunidade de aprender sobre EBC na prática.","Não","Iniciando com um estudo de caso em uma disciplina prática, por exemplo, banco de dados."],["24/11/2022 10:06:44","Sim","Doutorado","8","IFBA","Não","","","","","","","","","",""],["24/11/2022 12:08:20","Sim","Doutorado","23","UNEB","Sim","2","2","Sim","Adquirir competências é de suma importância para entrar e permanecer no mercado.","Sim","Formar alunos que tenham conhecimentos específicos e que o mercado exige é poder vender frutos do esforço em realizar um curso superior.","Sim","Ensinar coisas que são relevantes para a formação profissional de um aluno é o desejo de todo o professor.","Não","Infelizmente as instituições brasileiras privadas só visam o lucro e as instituições públicas possuem professores obsoletos e que não se especializam em novas tecnologias. O ensino no Brasil está no fundo do poço."],["25/11/2022 08:15:08","Sim","Doutorado","29","UNEB","Não","","","","","","","","","",""],["25/11/2022 12:01:32","Sim","Doutorado em andamento","10","IFBA","Não","","","","","","","","","",""],["25/11/2022 13:02:02","Sim","Doutorado","16","IFBA","Não","","","","","","","","","",""],["25/11/2022 20:48:15","Sim","Mestrado","10","IFBA","Sim","2","5","Sim","Porque cria uma relação de identidade com o aluno, onde suas habilidades podem ser melhor exploradas.","Sim","Porque mostra ao aluno que ele pode explorar as suas habilidades de forma mais madura.","Não","Não me sinto preparada ao ponto de ministrar um curso, mas tenho vontade de ser uma aluna do.mesmo.","Não","Não sei"],["29/11/2022 11:35:48","Não","","","IFBA","","","","","","","","","","",""],["29/11/2022 15:54:23","Sim","Doutorado em andamento","12","IFBA","Sim","3","3","Sim","o mercado de trabalho na área da computação já não exige diplomas, não tem conselho fiscalizador, nesse sentido muitas empresas já tem oferecido capacitações dentro do próprio ambiente de trabalho. Sendo assim, ele progride na empresa baseado nas suas habilidades e competências do que no título. ","Sim","Em disciplinas de programação já acontece isso, visto que não é um conhecimento nivelado, e muitos alunos já procuram avançar de forma individualizada.","Sim","Já acompanho meus alunos de linguagem de programação de forma individualizada e já me proponho a desafiá-los buscando evolução. Cada um no seu nível e ritmo.","Não","primeiro é necessário capacitar os professores ... e depois colando algumas turmas como projetos pilotos e fazendo o correto acompanhamento."],["01/12/2022 08:15:57","Sim","Doutorado","22","UFRB","Não","","","","","","","","","",""],["01/12/2022 08:25:30","Sim","Doutorado","20","UFBA","Não","","","","","","","","","",""],["01/12/2022 09:47:57","Sim","Mestrado","4","IFBA","Não","","","","","","","","","",""],["01/12/2022 11:17:35","Sim","Especialização","13","IFBA","Sim","3","3","Sim","O acompanhamento no processo de aprendizagem contribui no conhecimento necessário no desenvolvimento profissional.","Sim","Sim, e necessária.","Não","Em outro momento creio que sim.","Não","Com motivação institucional e individual dos docentes."],["01/12/2022 11:56:32","Sim","Doutorado","5","UFBA","Sim","1","5","Sim","Entendo que a EBA permite que a aprendizagem não seria definida por um período de tempo de um curso mas sim pelas competências/habilidades desenvolvidas. Dessa forma, o estudante iria realizar as etapas de conteúdos/assuntos por meio de testes, por exemplo, ou atividades que atestem suas habilidades e não precisaria realizar um curso completo.  ","Sim","Permite o desenvolvimento da autonomia nos estudantes pois a ebc aponta que o protagonismo do processo de aprendizagem não é da universidade e sim do próprio estudante.Ao invés de se basear em aulas expositivas de transmissão de um conhecimento padronizado, ela passa a considerar as particularidades dos alunos.   Uma oportunidade seria também realizar reflexões sobre o currículo dos cursos, uma vez que, por meio da EBC existe uma lógica baseada em aprimorar os conhecimentos e habilidades específicos de cada estudante e curso de forma personalizada.","Não","No momento ainda não tenho habilidades / conhecimento suficiente sobre a temática. ","Sim","Conheço poucas experiências que fazem uso da EBC. Poderia existir um suporte pedagógico/didático maior aos docentes que desejassem utilizar essa abordagem. "],["01/12/2022 13:10:30","Sim","Doutorado","12","UEFS","Não","","","","","","","","","",""],["02/12/2022 08:10:13","Sim","Doutorado","30 anos","UFBA","Não","","","","","","","","","",""],["02/12/2022 09:02:47","Sim","Mestrado","13","Centro Universitário ","Sim","4","4","Sim","Ira foca nas habilidades que ele deve ter que o mercado de trabalho exige","Sim","Porque preparar os alunos para o mercado de trabalho","Sim","Já ministro e  a experiência é muito boa","Sim","Mostrando as vantagens"],["02/12/2022 11:28:07","Sim","Doutorado","20","UESB","Sim","1","4","Sim","Só conheço Educação Baseada em Competência de ouvir falar, mas acho que pode auxiliar no desenvolvimento de habilidades e competências necessárias para o mercado de trabalho","Sim","Eu não sei responder a questão anterior, mas não tinha uma terceira opção.","Sim","Desde que eu tivesse me preparado adequadamente, estudo sobre o método, acho que seria interessante aplicá-lo e compará-lo com minha prática atual. Perceber a aceitação e o desempenho dos alunos. ","Não","Acho que através de eventos (palestras, minicursos, etc) sobre o assunto e treinamento contínuo nas semanas pedagógicas. "],["02/12/2022 12:04:08","Sim","Doutorado em andamento","20","UFBA","Sim","2","1","Sim","As competências mostram-se mais direcionadas às necessidades profissionais e práticas do estudante. Além disso, elas são muito mais facilmente ajustáveis as mudanças do mercado de trabalho do que os conhecimentos tradicionais curriculares.","Sim","Penso que principalmente no ensino superior o ensino baseado em competências é a forma mais adequada, pois o estudante já tem a motivação (e as demandas específicas) do mercado ou da academia.","Sim","É uma abordagem interessante e o curso em que atuo tem abertura para isso.","Não","Conduzindo ações para divulgação do EBC (seminários, workshops...), incentivar os docentes a adotarem EBC em suas disciplinas, premiando docentes que que adotam EBC, divulgando os resultados da adoção do EBC. "],["02/12/2022 13:46:54","Sim","Doutorado","28","UFBA","Sim","3","5","Sim","Sim,pois o mercado já é voltado para avaliação de competências.","Sim","A ebc fornece subsídios para uma formação mais antenada com os desafios atuais.","Sim","Sim, acho que o sistema baseado em notas não é suficiente para a formação do estudante ","Sim","Eu acho que iniciativas como o Ateliê Didático da ufba é um bom começo."],["04/12/2022 11:51:09","Sim","Doutorado","20","UESB","Sim","4","5","Sim","O desenvolvimento de competências pode gerar conhecimentos, habilidades e atitudes que o mercado de trabalho demanda dos profissionais que atuam na Área de Computação. Creio que cada vez mais é preciso alinhar os conteúdos programáticos dos cursos com as reais demandas da sociedade. Ademais, é preciso compreender que os alunos devem estar capacitados para resolver problemas que mudança rapidamente no contexto da sociedade contemporânea. Deve-se conhecer, portanto, as necessidades dos mercado e as necessidades dos alunos para formar pessoas certas para as posições corretas no mercado de trabalho,","Sim","Nos projetos pedagógicos dos cursos é recomendável que as competências desejadas estejam previstas. É lógico que essas competências direcionam os alunos para focar em um estilo de aprendizagem que correlaciona os conhecimentos, as habilidades e atitudes previstas nas Diretrizes Curriculares Nacionais, no Projeto Pedagógico do Curso (PCC), no Plano de Desenvolvimento Institucional (PDI) e nos Planos Individuais e Coletivos de Aprendizagem.","Sim","Tenho um conhecimento inicial do assunto em questão, porém, quando se estar atuando de maneira sistemática em um Projeto de Curso que utiliza o Ensino Baseado em Competências a atuação docente será planejada,a companhada e a avalidação por instrumentos, métodos e técnicas diferentes da ação indivudal de alguns gestores, docentes, discentes, pessoal técnico-administrativos e parceiros envolvidos nos programas, projetos e ações do supracitado ensino fundamentado no desenvolvimento de competências. ","Sim","Inicialmente, é recomendável que sejam criados espaços para discussão sobre o Ensino Baseado em Competências, a exemplo de fóruns de discussão, cursos, seminários, workshops, simpósios, seminários, rodas de conversas, entre outras tantas possibilidades para apresentar e motivar todos os envolvidos no Ensino Basaeado em Competências. Ressalta-se, portanto, que é preciso envolver um rol de pessoas que farão parte das ações aqui referenciadas. É preciso acordar as responsabilidades dos gestores, dos docent3es, dos discentes, dos servidores técnico-administrativos, de outros stakeholderss  internos e externos"],["05/12/2022 09:08:12","Sim","Doutorado","23","UESB","Sim","2","3","Sim","Pode contribuir na formação de profissionais voltados para às necessidades do mercado de trabalho.","Sim","Permite um currículo mais flexível e voltado para um mercado de trabalho em constante evolução.","Sim","Seria interessante.","Não","Através de formação de professores."],["05/12/2022 11:31:05","Sim","Doutorado","22","UNEB","Sim","2","3","Sim","Porque une a teoria a prática ","Sim","Porque a prática é posta imediatamente em ação ","Sim","Porque o mesmo poderia se transformar em um projeto de extensão imediatamente.","Não","Divulgando o que é, objetivos, vantagens e implantação do mesmo."],["06/12/2022 20:38:20","Sim","Mestrado","20","UEFS","Não","","","","","","","","","",""],["06/12/2022 21:48:37","Sim","Doutorado","30","UEFS","Sim","2","2","Sim","Sempre é interessante essa metodologias para tentar melhorar o aprendizado","Não","Acho que deve ser um conjunto de metodologias","Não","Não acredito apenas em uma metodologia de ensino, mas um conjunto de metodologias","Sim","Não sei"],["07/12/2022 10:22:40","Sim","Doutorado","25","UEFS","Não","","","","","","","","","",""],["14/12/2022 16:32:49","Sim","Mestrado","12","IFBA","Sim","3","5","Sim","A compreensão da aplicabilidade dos conteúdos aumenta circunstancialmente a motivação do aluno, e proporciona uma aprendizagem construtiva potencializando assim a autoconfiança, autoestima e etc. Neste sentido, permite o desenvolvimento da capacidade de \"aprender a aprender\" através de uma reflexão crítica e desta forma uma melhor adequação postural diante das necessidades mercadológicas. ","Sim","Pois permite uma aprendizado significativo, relacionando os saberes (conhecer, ser, fazer e viver) com situações ou fatos da vida cotidiana.","Sim","Um educação na perspectiva omnilateral perpassa por fazer o educando entender que ele é sujeito do processo de ensino aprendizado e que este saber fazer não é estático, sendo assim é necessário uma reflexão de padrões de autoaprendizado e atualização constante por parte do educando. Vejo isso como um desafio, visto que muitos ainda se colocam como consumista de conteúdo, assim como aprenderam ao longo da sua vida escolar,  ainda que por algumas vezes ao ser estimulados a atitude de curiosidade e entusiasmo os leve a buscar mais do que lhe foi ofertado. Ressalto ainda que apesar de não ter como foco metodológico as competências, essas, são definidas com objeto dentro das disciplinas de estudo, buscando desenvolvê-las.","Sim","Cursos, palestras, workshop"]],"titles":["Carimbo de data/hora","Você está de acordo com os termos acima e deseja participar do estudo ?","Qual o seu nível educacional?","Há quantos anos você trabalha como educador? (informar em anos)","Qual a sua instituição?","Você conhece a Educação Baseada em Competências?","Como você considera o seu grau de conhecimento sobre a Educação Baseada em Competências?","De um modo geral, qual a sua percepção sobre a Educação Baseada em Competências no ensino superior?","Na sua opinião, a Educação Baseada em Competências pode contribuir para o desenvolvimento do aluno de computação perante o mercado de trabalho?","Explique a resposta anterior ","Você acha que a Educação Baseada em Competências é uma boa forma de aprendizagem para os alunos do ensino superior de computação?","Explique a resposta anterior ","Você teria interesse em ministrar um curso utilizando o método de Ensino Baseado em Competências?","Explique a resposta anterior ","A sua instituição já trabalha ou já apresentou algo sobre a Educação Baseada em Competências?","Em sua opinião, como as instituições de ensino podem iniciar o processo de motivação ao docente para o Ensino Baseado em Competências?"],"language":"ptBr","classifications":["timestamp","terms","openQuestion","groupsInAnswer","openQuestion","yesOrNot","negativeOrList","openQuestion","negativeOrList","yesOrNot","negativeOrList","yesOrNot","openQuestion","yesOrNot","openQuestion","yesOrNot"]}