{"language":"ptBr","titles":["Carimbo de data/hora","Você está de acordo com os termos acima e deseja participar do estudo ?","Qual o seu nível educacional?","Há quantos anos você trabalha como educador? (informar em anos)","Qual a sua instituição?","Você conhece a Educação Baseada em Competências?","Como você considera o seu grau de conhecimento sobre a Educação Baseada em Competências?","De um modo geral, qual a sua percepção sobre a Educação Baseada em Competências no ensino superior?","Na sua opinião, a Educação Baseada em Competências pode contribuir para o desenvolvimento do aluno de computação perante o mercado de trabalho?","Explique a resposta anterior ","Você acha que a Educação Baseada em Competências é uma boa forma de aprendizagem para os alunos do ensino superior de computação?","Explique a resposta anterior ","Você teria interesse em ministrar um curso utilizando o método de Ensino Baseado em Competências?","Explique a resposta anterior ","A sua instituição já trabalha ou já apresentou algo sobre a Educação Baseada em Competências?","Em sua opinião, como as instituições de ensino podem iniciar o processo de motivação ao docente para o Ensino Baseado em Competências?"],"rows":[["07/11/2022 09:25:22","Sim","Mestrado","5","UFBA","Sim","5","5","Não","","Não","","Sim","","Sim","teste"],["10/11/2022 04:27:32","Sim","Mestrado","25","Uneb","Sim","3","4","Sim","Ajudaria muito pra o seu dia a dia no mundo do trabalho ","Sim","Sim, facilitaria o processo ensino aprendizagem ","Sim","Posso tentar","Não","Através de formação "],["10/11/2022 15:51:58","Sim","Especialização","8","Faculdade Santíssimo Sacramento","Não","","","","","","","","","",""],["10/11/2022 18:24:12","Sim","Doutorado em andamento","11","Instituto Federal de Mato Grosso do Sul","Sim","3","4","Sim","Como um dos componentes da competência é o saber como aplicar o conhecimento e as habilidades necessárias para isso, o ensino baseado em competências pode tornar a adaptação para o mercado de trabalho mais rápida. ","Sim","Uma parte importante do ensino baseado em competências é trabalhar a motivação dos estudantes em conjunto com as habilidades necessárias para a realização de atividades na área. Desta forma, poderíamos dirimir a visão de que muitos estudantes possuem de que as etapas iniciais da formação nos cursos de computação é excessivamente conteudista e teórica.","Não","Não me julgo competente suficiente para ministrar um curso apesar de saber algumas noções sobre o tema. Mas com certeza participaria de uma formação.","Não","Promovendo seminários e formação continuada sobre o assunto, principalmente no que diz respeito à criação de currículos e sua implementação pedagógica em sala de aula. "],["11/11/2022 10:53:11","Sim","Doutorado em andamento","3 anos","Senar","Não","","","","","","","","","",""],["11/11/2022 10:56:35","Sim","Mestrado em andamento","10","FSSS","Sim","3","4","Sim","Aprendizagem  em um ritmo altamente individualizado.","Sim","-","Sim","Seria uma ótima experiência.","Não","Mostrando a importância da mesma."],["11/11/2022 22:06:24","Sim","Mestrado em andamento","28","Faculdade Santíssimo Sacramento ","Sim","5","5","Sim","Possibilitará talvez ao egresso ser especialista nas habilidades de interesse ","Sim","Cria melhores condições de desenvolver habilidades com focos específicos ","Sim","É importante um planejamento de curso detalhado e clareza dos objetivos do conhecimento e habilidades. Qualquer curso tem o objetivo de dar competência, porém, com as especificações norteadores das competências a serem claramente desenvolvidas, possibilita um maior acompanhamento e desenvolvimento desses competências ","Sim","Através da mobilização e sensibilização da comunidade acadêmica esclarecendo a proposta, incentivando sua implementação através de procedimento de implantação, estudo dos documentos norteadores, definição de resultados, utilização de estratégias de implantação da proposta e acompanhamento do processo."],["14/11/2022 08:54:05","Sim","Doutorado em andamento","16","UEFS","Não","","","","","","","","","",""],["18/11/2022 17:15:23","Sim","Doutorado","24","Universidade Estadual de Feira de Santana","Sim","3","5","Sim","Traz elementos como resolução de problemas, habilidades e atitudes esperadas para trabalhos em grupos/equipes, reflexão crítica das situações vivenciadas no ambiente de trabalho, dentre outros.","Sim","De forma semelhante à resposta anterior, Ensino baseado em competências poderá permitir o desenvolvimento de habilidades também chamadas de soft skills, para além dos conhecimentos técnicos necessários, o que pode possibilitar ao estudante de computação atitudes resolutivas de problemas, sejam estes de cunho técnico ou social (como inclusão e acessibilidade, por exemplo), assim como postura crítica/reflexiva sobre as questões relacionadas. O estudante pode ganhar mais autonomia no seu processo de aprendizagem (aprendendo a aprender constantemente), com orientação/mediação docente, importante no processo construtivo.","Sim","Acredito que metodologias que permitam ao estudante exercer um papel mais ativo e central em seu processo permanente de aprendizagem possibilitam importantes construções cognitivas e formativas, tanto para o estudante quanto para o professor/educador.","Não","Embora não exatamente com esta nomenclatura, a nossa instituição já trabalha estratégias de ensino que se assemelham a esta proposta e que caminham de maneiras semelhantes. Entretanto, são iniciativas pontuais ou de alguns cursos específicos. Acredito que a formação docente continuada seja um caminho para a compreensão de novas estratégias e metodologias de ensino, sobretudo com estudos de casos, relatos de experiências, que evidenciem casos de sucesso e/ou como estas estratégias e metodologias podem ser aplicadas nos ensino fundamental, médio e superior."]],"classifications":["timestamp","terms","openQuestion","groupsInAnswer","openQuestion","yesOrNot","groupsInAnswer","groupsInAnswer","yesOrNot","openQuestion","negativeOrList","openQuestion","yesOrNot","openQuestion","yesOrNot","openQuestion"]}